Repository: OrbintSoft/Calculator
Catalog: Calculator/Resources/Generic.*.resx
Languages: it

source: [operand 1] [operator] [operand 2]
it: [operandi 1] [operatore] [operando 2]

source: -f (--file) [File path of input file] [opcode, default: 0 (Addition)]
it: -f (--file) [Percorso del file di ingresso] [opcode, default: 0 (Addizione)]

source: -h (--help) / -? Prints list of commands
it: -h (--help) / -? Stampa la lista dei comandi

source: -i (--interactive) The programs works in console interactive mode, follow display istructions
it: -i (--interactive) Il programma lavora in modalità interattiva, segui le istruzioni mostrate in console

source: Addition
it: Addizione

source: Allowed operations in expression:
it: Operazioni consentite nell'espressione:

source: Brackets are not mandatory be operator order is respected
it: Le parentesi non sono obbligatorie se l'ordine degli operatori è rispettato

source: Chose an operation
it: Scegli un'operazione

source: Division
it: Divisione

source: Error
it: Errore

source: ex: 2 + 4
it: es: 2 + 4

source: Expression
it: Espressione

source: Expression input format:
it: Formato di ingresso dell'espressione:

source: Expression syntax:
it: Sintassi dell'espressione:

source: Input File not found
it: File di ingresso non trovato

source: Insert the desidered expression:
it: Inserisci l'espressione desiderata:

source: Insert the operand {0}:
it: Inserisci l'operando {0}:

source: Logarithm
it: Logaritmo

source: Multiplication
it: Moltiplicazione

source: No argument provided, type --help to get list of available commands
it: Non è stato fornito nessun comando, digita --help per ottenere la lista dei comandi disponibili

source: Operation not supported
it: Operazione non supportata

source: Operator order:
it: Ordine degli operatori:

source: Power
it: Potenza

source: Result: {0}
it: Risultato: {0}

source: Root
it: Radice

source: Substraction
it: Sottrazione

source: type 'q' to quit the program
it: digita 'q' per chiudere il programma

source: Wrong arguments provided, type --help to get list of available commands
it: Parametri forniti non corretti, digita --help per ottenere la lista dei comandi disponibili

source: Wrong number of arguments
it: Numero sbagliato di parametri

source: [(] Open an expressione, [)] close an expression
it: [(] Apri un espression, [)] chiudi un espressione

source: [*] Multiplication, ex: 2 * 3 = 6
it: [*] Moltiplicazione, es: 2 * 3 = 6

source: [+] Addition, ex: 2 + 3 = 5
it: [+] Addizione, es: 2 + 3 = 5

source: [-] Substraction, ex: 5 - 3 = 2
it: [-] Sottrazione, es: 5 - 3 = 2

# [.] is the decimal separator, ex: 23.4577
source: [.] is the decimal separator, es: 23.4577
it: [.] è il separatore decimale, ex: 23.4577

source: [/] Division, ex: 6 / 3 = 2
it: [/] Divisione, es: 6 / 3 = 2

source: [l] Logarithm, ex: 8 l 2 = 3
it: [l] Logaritmo, es: 8 l 2 = 3

source: [r] Root, ex: 8 r 3 = 2
it: [r] Radice, es: 8 r 3 = 2

source: [^] Power, ex: 2 ^ 3 = 8
it: [^] Potenza, es: 2 ^ 3 = 8

source: {0} is not a valid number
it: {0} non è un numero valido

source: {0}: Addition
it: {0}: Addizione

source: {0}: Division
it: {0}: Divisione

source: {0}: Expression
it: {0}: Espressione

source: {0}: Logarithm
it: {0}: Logaritmo

source: {0}: Multiplication
it: {0}: Moltiplicazione

source: {0}: Power
it: {0}: Potenza

source: {0}: Root
it: {0}: Radice

source: {0}: Substraction
it: {0}: Sottrazione

source: ([operand 1] [operator] [operand 2]) [operator] [operand 3]
it: ([operando 1] [operatore] [operando 2]) [operatore] [operando 3]
